{
  "body": ">Yo this shit is weird\n\n-Snoop Dogg if he watched Zombieland Saga. probably\n\n__introduction__\nAnime is weird. Surprising news, I know. Even taking into consideration how Japan has a different culture then that of in the west, there are some anime that are creative to the point of ridiculousness. While this creativity may turn some people of, I can speak for most anime fans that the weirdness of anime is charm of it. That doesn't mean that anime which are weird can't be taken seriously. Attack On Titan has a ridiculous premise but is still able to tell a serious story that covers many topics, but today we are not going to talk about that kind of anime: We are talking about Zombieland Saga.  \n  \nWith the first season airing in october of 2018 and the second season in april of 2021, Zombieland Saga has gotten quite the reputation as the gateway drug of idol anime. It is not a surprise it has become the most popular idol tv-series of all time in the west, with getting second place of most popular idol anime of all time to Perfect Blue. So why has this become the most popular idol anime of all time and is the title really worth it? Well, today I am gonna review both seasons of Zombieland Saga to find it out.\n\n__a quick summary of the story__\n\nIn the first scene of the anime we see Sakura. It is the day she starts her second year of highschool and she found the motivation to finally file an aplication for becoming an idol. As she runs outside, brimming with excitement, she gets by a truck. Her hit with the truck gets played several times, all from different angles, then as her lifeless body flies through the air, a heavy metal song starts to play.\n\n~~~img600(https:\/\/c.tenor.com\/7lFwJGiIfuQAAAAd\/zombie-land-saga-zombieland.gif)~~~\n\nSo yeah, Zombieland Saga quickly ascerts its dominance in the very first two minutes. A great opening scene to anime that will only get more insane as it goes on.\n\nWhen Sakura wakes back up, she has become a zombie. She is not the only one, because several girls around her are also zombies. A man enters the room, and he is called Koutarou. He exclaims that he resurrected all of these zombies to form one idol group. Their mission? Save the prefecture of Saga of becoming obsolete. And so they begin. Throughout the anime we see the idol group try to make a name for theirselves while being aided by their insane manager Koutarou.\n\n__the really fun characters__\n\n~~~img600(https:\/\/i0.wp.com\/www.animefeminist.com\/wp-content\/uploads\/2019\/08\/zls.jpg?ssl=1)~~~\n\nWith the story out of the way, I just want to say that the characters are wonderful. Sakura seems to lack a bit of presence, but how she tries to bring sense in a world of chaos and failing at that multiple times always brings a good laugh. Saki brings some much needed punch to the cast, not easily backing down but still brimming with lots of passion. Both Ai and Junko also don't have much presence besides being the pros, but they still bring a lot of heart to this series. Lily is Lily, talking more about her would mean to talk about controversy so I will leave it at that. Yuugiri is a character I really love but seems to be underutilised. She is the \"onee-san\" type but doesn't seem to do much besides slap people from time to time. There are a few episodes in which she is able to shine, but we will get to those soon. Tae Yamada is a comedic genius. Even though she is only sentient enough to be just not be considered an animal, she brings a lot good slapstick to the anime. Lastly, we can't forget about my boy Koutarou. While he can be annoying at times, it is hard to hate him because the voice actor Mamoru Miyano absolutely __kills__ as the role. The passion, the comedic timing, the hilarious in english, Koutarou is a wild personality that is toe to toe with Yamada Tae's comedic genius. \n\nAll in all, the character cast is pretty dang good and all the characters have such good chemistry with eachother, so much so that....\n\n__the anime is hilarious (and insane)__\n\nIn episode 5 of season 2, Lily joins a got talent competition. As her performance, Lily sings a balad she sung a lot when she was alive, but since she is dead now she does her own spin on the balad. What do you think she did to the song to make it her own now?\n\n.....\n\nOkay, if you guessed that she would do a boppy remix of it where she does scat like scatman over it, then congratulations you either watched the show or have insane prophet powers.\n\nThis is what makes the show for me. Zombieland Saga is isane. Almost everye episode has them doing something out of left field that I would never predict, and it is funny. It is really funny. One episode you can have an emotional arc about what it means to be an idol, and in the next episode you can have Ai hitting Koutarou with a baguette:\n\n~~~img600(https:\/\/i.kym-cdn.com\/photos\/images\/original\/001\/427\/331\/aa6.gif)~~~\n~~~__Look at this. This is peak animation.__~~~\n\nIt isn't just weird situations and outcomes, sometimes entire episodes are just fucking insane. Like episode 8 & 9 of season 2 it suddenly turns into a serious historical drama that is _good_. The comedy of those episodes then don't thrive of the jokes themselves, just the fact that the anime takes the daring decision to turn from a zombie idol series to a fucking historical drama. That blows my mind while simultanously making me laugh.\n\nLuckily the comedy isn't just out of left field stuff. They get a lot of mileage of the characters being zombies. The constant struggle to keep their identities as zombies safe leads to some great comedic moments. The chemistry between the different characters is especially funny, I don't think there is a single Koutarou scene that makes the best out the relationship he has with the other characters. \n\nSo yeah, the anime is hilarious and I love its comedy, That is why I am sad to say that...\n\n__the anime still has flaws (sadly)__\n\nYou know how I mentioned that this anime is an idol anime? Well it sure is, which is both a good thing and a bad thing. The good thing is that we can get the most ridiculous parts of being an idol, the bad thing is that the drama that comes from being an idol is pretty boring and akward. The drama between how the characters question if they are good enough for the group or have to face their (sometimes difficult) past is the weakest part of the show for me. I enjoy to some degree, but it gets hard for me to care when I am just waiting for the funny bits to start again. Maybe it is because I don't really watch idol anime or know any real life idols, so it could be just a me thing. I do have to mention that this problem is mostly seen in season 1, in season 2 it gets a lot more insane and less emotional, which I really like as a change.\n\nWhat can probably be universally agreed upon is the production values. For most times, it is pretty dang good. All the characters are really expressive and it has some wild sequences, but when it comes to idol shows in the anime.. it begins to nosedive in quality, which is due to our good old friend CGI.\n\n~~~img600(https:\/\/64.media.tumblr.com\/cdc5825b3a6186c54760357f1d697a85\/tumblr_pk2p56kALg1u86t2qo1_500.gif)~~~\n\nThe visual clash between the handdrawn animation and the CGI is jarring and the CGI itself is just kinda mediocre. Like look at this gif. It is not that bad innit of itself, but compare it to the bread gif I showed earlier and you can tell how off it is. It sucks because the CGI performances are often the emotional climaxes of the show and they scale down the impact of these climaxes by a ton. I do have to mention that season 2 the CGI _slightly_ improves (in that the characters are a lot more expressive, but since the 3D camera goes all over the place this improvement can barely be seen). \n\nLast thing I want to touch on is the music.... which is just okay. There are some songs I absolutely love from this anime. The openings of both seasons are bagners, the ending of the first season is great and Yuugiri's song might be my favorite song of the entire anime, but the rest of the songs I don't really have much to say about them. I listened to them once and I barely remember them, which is not great for anime that is about music. \n\n__just watch the damn anime__\n\nDespite my gripes with it, I enjoyed my time with this anime a lot. Zombieland Saga is an anime that bathes in its ridiculousness to the point of hilarity. The characters are great, the comedy is on point and its insanity is a joy. It deserves its popularity and it deserves its praise. You are missing out if you haven't watched this show yet.",
  "createdAt": 1628519927,
  "id": 12869,
  "mediaType": "ANIME",
  "private": false,
  "rating": 10,
  "ratingAmount": 10,
  "score": 82,
  "siteUrl": "https:\/\/anilist.co\/review\/12869",
  "summary": "This anime is absolutely insane and you should watch it",
  "updatedAt": 1628523720,
  "user": {
    "id": 488612,
    "name": "Groenboys",
    "about": "I am a weeb of many hobbies, including watching anime, watching vtubers, scrolling Twitter, posting on Reddit and tryharding 1.9 Minecraft.\n\nGive me a follow if you like my posts and reviews.",
    "avatar": {
      "large": "https:\/\/s4.anilist.co\/file\/anilistcdn\/user\/avatar\/large\/b488612-pmLqgzI5pc7l.png",
      "medium": "https:\/\/s4.anilist.co\/file\/anilistcdn\/user\/avatar\/medium\/b488612-pmLqgzI5pc7l.png"
    },
    "bannerImage": "https:\/\/s4.anilist.co\/file\/anilistcdn\/user\/banner\/b488612-RJaXlViqspCF.jpg",
    "isFollowing": false,
    "isFollower": false,
    "isBlocked": false,
    "donatorTier": 0,
    "donatorBadge": "Donator",
    "siteUrl": "https:\/\/anilist.co\/user\/488612",
    "updatedAt": 1628522149
  },
  "userRating": "NO_VOTE"
}